In [4]:
import pandas as pd

In [5]:
## structure data 
# dataframe  

dt = {"Name":["aman","gagan","naman","chaman"],
     "branch":['it','it','cse','ece'], 
     "class":[2,1,3,4], 
     "city":['jaipur','aligarh','vridavan','mathura']}  
dt

{'Name': ['aman', 'gagan', 'naman', 'chaman'],
 'branch': ['it', 'it', 'cse', 'ece'],
 'class': [2, 1, 3, 4],
 'city': ['jaipur', 'aligarh', 'vridavan', 'mathura']}

In [8]:
# type(dt )  

df = pd.DataFrame(dt) 
df

     Name branch  class      city
0    aman     it      2    jaipur
1   gagan     it      1   aligarh
2   naman    cse      3  vridavan
3  chaman    ece      4   mathura

In [9]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [11]:
df['Name']   ## signle columns type ===> series

0      aman
1     gagan
2     naman
3    chaman
Name: Name, dtype: object

In [12]:
type(df['Name'] )

pandas.core.series.Series

In [19]:
df[['branch','Name']]  #

  branch    Name
0     it    aman
1     it   gagan
2    cse   naman
3    ece  chaman

In [16]:
d

     Name branch  class      city
0    aman     it      2    jaipur
1   gagan     it      1   aligarh
2   naman    cse      3  vridavan
3  chaman    ece      4   mathura